{"data":{"markdownRemark":{"html":"<p>Last night, I spent about an hour making systemd unit files for each service I use on my DigitalOcean droplet that I have previously either left running in tmux sessions or started manually myself. I had put this off for so long because I wasn't very familiar with how systemd worked outside of starting, stopping, and restarting services that are already configured to use systemd. However, after spending an hour or so reading documenation on the init system to help solve a server automation problem at work, I learned that you can turn processes into simple systemd services by repeating a small set of configuration options.</p>\n<p>For a little background, I've been running around five side projects/other programs by going to their working directories, running the command to start each program, and backgrounding the process. In order to restart these programs, I had to grep <code>ps</code> output in order to find the pid, and then <code>kill</code> the process. I also had to remember (or grep through shell history to find) each command to start each process. The most complicated of these was <code>php -S localhost:2000 index.php &#x26;>> twiddit.log &#x26;!</code>. I'm sure there are worse commands to remember that include many more arguments and multiple environment variable assignments, but it was still pretty annoying.</p>\n<p>Now that each program is started as a systemd service, I can start, stop, and restart each program through the <code>systemctl</code> command from anywhere on my machine, I can specify that they start on boot, and I can view each processes' logs through <code>journalctl</code>.</p>\n<h2>Example Time (yay)</h2>\n<p>I'm going to go over the systemd unit file I wrote to make this Jekyll blog into a systemd service.</p>\n<p>Here's the whole thing.</p>\n<pre><code class=\"language-conf\"># jekyll.service\n[Unit]\nDescription=Jekyll\nAfter=network.target\n\n[Service]\nType=simple\nWorkingDirectory=/home/jekyll/blog\nExecStart=/usr/local/bin/jekyll serve\nUser=jekyll\nGroup=jekyll\nRestart=always\n\n[Install]\nWantedBy=multi-user.target\n</code></pre>\n<p>There are three sections to this file, so we'll go over them one by one.</p>\n<h3>[Unit]</h3>\n<p>The Unit section contains generic information about the systemd unit, which is not specific to whether it is a systemd service, or mountpoint, or target, etc. For reference we are making a service.</p>\n<p>This Unit section on has a two options, <strong>Description</strong> and <strong>After</strong>. <strong>Description</strong> is used to describe the unit. <strong>After</strong> is used to specify any other units that we want this unit to start after. Since Jekyll is a blog, it would be helpful if the network on the system is initialized before Jekyll starts up.</p>\n<h3>[Service]</h3>\n<p>The Service section contains options that are specific to a service. The <strong>Type=simple</strong> means that this process does not fork after running the command in <strong>ExecStart</strong>, and should work in most simple cases. The <strong>WorkingDirectory</strong> describes where the context of this service takes place. If this is left blank, then the command in <strong>ExecStart</strong> will be run in the context of the <code>/</code> directory. My Jekyll directory just sits in the jekyll user's home directory so we'll use that. <strong>ExecStart</strong> specifies the command to run when this service is started. The path to the command has to be absolute and cannot be relative to the <strong>WorkingDiretory</strong>. The <strong>User</strong> and <strong>Group</strong> options specify which user and group this service will run as. It is important to specify these options if you do not want your service running as root. Finally, <strong>Restart</strong> can define when the service should be restarted. I've set this service to always restart in case it crashes for some reason.</p>\n<h3>[Install]</h3>\n<p>The Install section contains information that is used when services are installed with <code>systemctl enable</code>. This means that if <em>enabled</em>, this service will be started when the <code>multi-user.target</code> group is started. This is a pretty common option.</p>\n<h2>Let's actually use this</h2>\n<p><em>Note: All systemctl commands listed here will require root privileges.</em></p>\n<p>Okay, now that we have our service file all good to go, we are going to need to put it somewhere. The directory to put user-defined systemd unit files in is <code>/etc/systemd/system</code>. Place the above file in that directory under the name <code>jekyll.service</code>. Before starting the service, run <code>systemctl daemon-reload</code> to load the new unit file into systemd's configuration.</p>\n<p>To start the Jekyll service, run <code>systemctl start jekyll</code>.</p>\n<p>To stop the Jekyll service, run <code>systemctl stop jekyll</code>.</p>\n<p>To restart the Jekyll service, run <code>systemctl restart jekyll</code>.</p>\n<h3>Logging</h3>\n<p>Unless otherwise specified, output from systemd services goes to the systemd journal. To view the log output for a specific service, use <code>journalctl -u [service-name]</code>. This will open up the log in a pager for you to look through. If you would like to watch the log as it grows, run <code>journalctl -u [service-name] -f</code> and new entries in the log will appear at the bottom of the screen in a similar fashion to <code>tail -f</code>.</p>\n<h3>Starting services at boot</h3>\n<p>One of the most helpful things about using services for my running programs is that if I restart my server I don't have to remember to start up each individual program.</p>\n<p>To configure a service to start at boot, run <code>systemctl enable [service-name]</code>. This command symlinks the Jekyll service file in <code>/etc/systemd/system</code> into <code>/etc/systemd/system/multi-user.target.wants</code>, since we specified that the service is wanted by <code>multi-user.target</code>.</p>\n<p>Now you can restart you server without having to remember to restart Jekyll. Cool!</p>\n<h2>One last thing</h2>\n<p>I'm sure there are many things about systemd that I don't know about yet, so know that there are a lot of different ways to set up unit files for different types of services. Hopefully this is helpful enough to get you up and running, and to provide a good enough foundation to learn a little more if this guide doesn't quite address your needs. If I messed something up feel free to let me know.</p>\n<h2>References</h2>\n<p><a href=\"https://www.freedesktop.org/software/systemd/man/systemd.unit.html\">systemd.unit</a></p>\n<p><a href=\"https://www.freedesktop.org/software/systemd/man/systemd.service.html\">systemd.service</a></p>\n<p><a href=\"https://www.freedesktop.org/software/systemd/man/systemd.index.html\">systemd.index</a></p>\n<p><a href=\"https://www.freedesktop.org/software/systemd/man/systemd.target.html\">systemd.target</a></p>","frontmatter":{"title":"Make your web apps into systemd services"}}},"pageContext":{"slug":"/2016-08-04-use-services-for-your-web-apps/"}}