{"data":{"markdownRemark":{"html":"<p>This is a little bit of a meta post about how this blog runs and how I'm changing it.</p>\n<h3>Background</h3>\n<p>This blog is generated using <a href=\"https://jekyllrb.com\">Jekyll</a>, a pretty popular static site generator that basically takes markdown and outputs static HTML files. This makes it pretty easy to write posts in a nice format like Markdown or CommonMark or whatever and convert it to an actual webpage. It's also nice to use because you don't need to run a database server to store blog posts in and you don't need to run an application server like PHP or Python or Ruby or whatever to query the database, build a template, and then eventually build the webpage. My blog in particular isn't very dynamic, so it just doesn't need that level or complexity.</p>\n<h3>Old and Busted</h3>\n<p>When I originally started testing out a Jekyll install, I used this really neat feature that Jekyll provides that lets you run a development server to serve blog files using their own Ruby HTTP server. I used that method primarly and eventually forgot that you can just use <code>jekyll build</code> to generate a blog directory to place in the path of a web server like nginx or apache. What I did instead was to have nginx proxy any blog requests to the internal server that Jekyll was running. I eventually moved the blog to a FreeBSD machine and placed the server in its own jail so that it could not interact with any other processes and could only be accessed over its internal IP address. This didn't change the reverse proxy behavior for nginx, because instead of proxying the request to <code>localhost:4000</code> it just proxied to <code>&#x3C;jail-ip>:4000</code> instead.</p>\n<p>Something else about the old setup was that uploading new files was not a very simple procedure. Whenever I wrote a new post, I had to rsync the markdown file to the FreeBSD host, then copy it into the Jekyll jail's chroot'ed subdirectory, then enter the jail and run jekyll build to refresh the generated static files.</p>\n<h3>New Hotness</h3>\n<p>Like I mentioned earlier, Jekyll is primarily for generating static HTML files from Markdown files, not serving them. The new method of serving the blog involves taking the source Markdown files and outputting the generated files in the <code>blog</code> directory of the webroot for <code>devopps.me</code>. Instead of proxying the request off to a Ruby server and proxying it back in the response, nginx can just serve the static file, which it's really good at.</p>\n<p>Since I was taking some time to revamp how the blog is served, I thought I'd take the time to revamp how the blog is updated. Instead of some rsync/cp/jexec command, I thought it'd be cool to keep the blog in a git repo and add a <code>post-receive</code> event to regenerate the static files. The way this works is that I host a remote repo for the blog on my server and push updates to it when I finish new posts. When the remote repo is updated, it triggers the <code>post-receive</code> hook, which is specified in <code>hooks/post-receive</code> in the remote repo directory.</p>\n<p>There's a <a href=\"https://jekyllrb.com/docs/deployment-methods/#git-post-receive-hook\">super helpful guide</a> for doing this in Jekyll's documentation. The <code>post-receive</code> hook outputs the HTML version of the blog in a directory on the host. I didn't want to give the <code>git</code> user that runs the hook the superuser privileges needed to write to the webroot directory in the jail that nginx runs in, so I added a <code>mount.fstab</code> attribute in the jail's description in <code>/etc/jail.conf</code> that automatically nullfs mounts the output directory to the correct place in the nginx jail's webroot.</p>\n<p>The <code>/etc/jail.conf</code> entry for the nginx jail now looks something like</p>\n<pre><code class=\"language-conf\"># www\nwww {\n   host.hostname = \"www.devopps.me\";\n   ip4.addr = 172.16.1.1;\n   mount.fstab = \"/etc/fstab.www\";\n}\n</code></pre>\n<p>This reads a jail specific fstab file that Jekyll output directory as read-only into the nginx jail.</p>\n<p><strong>Fun Fact:</strong> This post was uploaded using the new git hook method.</p>","frontmatter":{"title":"Actually using Jekyll correctly"}}},"pageContext":{"slug":"/2017-04-08-using-jekyll/"}}