{"data":{"markdownRemark":{"html":"<p>I've been using the reference python implementation for LetsEncrypt since the beta days. I don't think that there's anything inherently wrong with it, but I recently heard about an alternative implementation called <a href=\"https://kristaps.bsd.lv/acme-client/\">acme-client</a> on an episode of <a href=\"http://www.jupiterbroadcasting.com/101327/fuzzy-auditing-bsd-now-151/\">BSDNow</a>. One of the great things about LetsEncrypt is that it uses an open specification called ACME. Because the specification is open, there are alternative implementations to use besides the reference one provided by LetsEncrypt. When I was using the reference client (now known as <a href=\"https://certbot.eff.org/\">certbot</a>), usage on FreeBSD was not competely supported. It also required a lot of dependencies and needed a lot of RAM to run. I understand that cloud computing resources are pretty cheap, but I thought it might be worthwhile to at least try a more lightweight C implementation. Plus it was <a href=\"http://undeadly.org/cgi?action=article&#x26;sid=20160901060733\">imported into OpenBSD</a> recently, and they seem to know a thing about security. Setting it up the first time was arguably more difficult than certbot, but hopefully you can benefit from some of the things I've learned so far. Just to reiterate, this guide is for setting up <em>acme-client</em> to work with a multi-domain nginx setup on a FreeBSD machine.</p>\n<h2>Background</h2>\n<p><em>acme-client</em> is written to make use of OpenBSD security features like <em>pledge</em>. The main idea behind pledge is that programs can be written in multiple parts and each part can be given only as many OS privileges as needed by that one portion of the program. This is useful in the case of a program that needs write access to files owned by <em>root</em>, but only for a certain portion of the program. Instead of running a single process as root that reads and writes over a network interface, reads from the filesystem, and then writes to another portion of the filesystem, multiple processes can run that only have a network, read, or write privileges. That being said, the portable version of <em>acme-client</em> does not support that level of isolation in FreeBSD, because FreeBSD does not have pledge. FreeBSD does have a similar sandbox system called <a href=\"https://www.freebsd.org/cgi/man.cgi?query=capsicum&#x26;sektion=4\">capsicum</a>, but the portable version does not support capsicum. That being said, the portable version of <em>acme-client</em> is still written so that each segment of the ACME procedure is segmented into its own process. One other benefit is that <em>acme-client</em> uses LibreSSL for TLS needs instead of OpenSSL.</p>\n<h2>Installation</h2>\n<p>I couldn't find <em>acme-client</em> in the list of binary packages supplied by <em>pkg</em>, so I had to build it from the ports tree at <code>/usr/ports/security/acme-client</code>. I built it with <code>make package</code> and added the resulting <em>txz</em> file to <em>pkg</em> by using <code>pkg add &#x3C;filename></code>. If you are planning on running this in a jail, you can move the package file into your jail's subdirectory and add it to <em>pkg</em> from within the jail. I run nginx from within a jail, so I did that.</p>\n<p><em>Edit: (04-08-2017)</em> There is now an <em>acme-client</em> binary package, so you can install it with <code>pkg install acme-client</code>.</p>\n<h2>Configuration</h2>\n<h3>Challenge Directory Setup</h3>\n<p>By default, <em>acme-client</em> places challenge files in <code>/usr/local/www/acme</code>. You can override this with the <code>-C</code> flag, but I found it was easier to map that directory into the default nginx location for <code>.well-known/acme-challenge</code>.</p>\n<p>To make this happen I added a new configuration file in <code>/usr/local/etc/nginx</code> called <code>acme.conf</code> with the following text.</p>\n<pre><code class=\"language-conf\"># acme.conf\nlocation ^~ /.well-known/acme-challenge {\n   alias /usr/local/www/acme;\n   try_files $uri =404;\n}\n</code></pre>\n<p>I then added the following line in the server block in <code>/usr/local/etc/nginx/nginx.conf</code></p>\n<pre><code class=\"language-conf\">include acme.conf;\n</code></pre>\n<p>By doing this, all domains that are served by nginx will correctly serve challenge files placed by <em>acme-client</em>. No further configuration with <em>acme-client</em> is necessary for this portion of the validation process.</p>\n<h3>The <em>acme-client</em> Command</h3>\n<p>In order to get certificates for your domains, you'll need to be aware of which flags to use when using the <code>acme-client</code> command. I run the command in the following format:</p>\n<pre><code class=\"language-sh\">acme-client \\\n-v  \\    # Verbose logging to know what the client is doing.\n-e  \\    # Allows expanding the domains listed in the certificate. This is necessary if you want to add a subdomain.\n-m  \\    # The bread and butter. Appends {domain} to all default directory paths for public, private, and account keys.\n-b  \\    # Backs up certs when they are modified or removed. Why not.\n-n  \\    # Creates a new 4096-bit RSA account key if you don't already have one.\n-N  \\    # Creates a new 4096-bit RSA domain key if you don't already have one.\ndomain \\ # devopps.me\n[altnames...] # www.devopps.me blog.devopps.me irc.devopps.me\n</code></pre>\n<p>Running this per domain will get you certificates for each of your domains. Pretty cool. However, LetsEncrypt certificates are only valid for a maximum of 90 days, so it's a really good idea to automate this so that you don't forget and have certificate validation errors when people try to visit your website.</p>\n<h3>Automation (wow who saw this coming)</h3>\n<p>There are two important things to do to automate away this procedure. The first is to create a script that will run this script for each of your domains. The second is to add this script to the <code>/usr/local/etc/periodic/weekly</code> directory.</p>\n<h4>The Script</h4>\n<p>There is already a <a href=\"https://svnweb.freebsd.org/ports/head/security/acme-client/files/acme-client.sh.sample.in?view=markup&#x26;pathrev=425172\">sample script</a> included when you install this package added by the wonderful port maintainer. It works pretty well, but with the configuration we did with nginx and <em>acme-client</em>, we can forego some of the complexity.</p>\n<p>Here's is the script that I use:</p>\n<pre><code class=\"language-sh\">#!/bin/sh -e\n\nBASEDIR=\"/usr/local/etc/acme\"\nSSLDIR=\"/usr/local/etc/ssl/acme\"\nDOMAINSFILE=\"${BASEDIR}/domains.txt\"\nACME_FLAGS=\"-v -e -m -b -n -N\"\n\ncat \"${DOMAINSFILE}\" | while read domain line ; do\n   set +e # RC=2 when time to expire > 30 days\n   acme-client ${ACME_FLAGS} ${domain} ${line}\n   RC=$?\n   set -e\n   [ $RC -ne 0 -a $RC -ne 2 ] &#x26;&#x26; exit $RC\ndone\n</code></pre>\n<p>The script expects a text file named <code>domains.txt</code> to be placed at <code>{$BASEDIR}/domains.txt</code>. In this case <code>$BASEDIR</code> is <code>/usr/local/etc/acme</code>. The format of the file should be:</p>\n<pre><code># domain altname altname...\ndevopps.me www.devopps.me irc.devopps.me\nopperwall.net www.opperwall.net\n</code></pre>\n<p>For each line, it reads in the domain and all altnames and calls <code>acme-client</code> with those parameters and the flags we discussed earlier. If the certificates are in need of renewing, they will be renewed. Otherwise it'll be a no-op. Running this script with a populated domains.txt should renew the certificates for all of your domains.</p>\n<h4>The Weekly Run</h4>\n<p>It's not too bad to run this manually every couple of weeks, but it's better to let the machine do the work for you. This can be automated by adding a script to the <code>/usr/local/etc/periodic/weekly</code>. The maintainers have included another awesome sample file here called <a href=\"https://svnweb.freebsd.org/ports/head/security/acme-client/files/000.acme-client.sh.in?view=markup&#x26;pathrev=425172\"><code>000.acme-client.sh</code></a>. You don't actually need to edit anything in this file, it's good as is.</p>\n<p>To make this file work, you need to set some variables in <code>/etc/rc.conf</code>. The lines you'll need are:</p>\n<pre><code class=\"language-sh\"># enable the weekly script\nweekly_acme_client_enable=\"YES\"\n# Specify the renew script to run\nweekly_acme_client_renewscript=\"/usr/local/etc/acme/&#x3C;your_renew_script>\"\n# Specify the deploy script to run\nweekly_acme_client_deployscript=\"/usr/local/etc/acme/&#x3C;your_deploy_script>\"\n</code></pre>\n<p>The deploy script can be used to move your certificates to other jails or other directories for other applications (mail, irc, mumble, etc.). At the very least, your deploy script should reload nginx so that the updated certificates are loaded in.</p>\n<p>Mine looks like:</p>\n<pre><code class=\"language-sh\">#!/bin/sh\n\nset -e\n\nservice nginx reload\n</code></pre>\n<h2>What Now?</h2>\n<p>You can add your newly acquired certificates to your nginx server block settings and serve requests over HTTPS now. Nice.\nI personally moved this blog to my FreeBSD DigitalOcean Droplet after setting this up, so maybe you could do something like that. :)</p>\n<h2>What If I Use Linux?</h2>\n<p>While the portable version of <em>acme-client</em> will work on Linux, it requires a few more dependencies. Some of the OS facilities used in this guide will need to be substituted for Linux stuff.</p>\n<ul>\n<li>You'll need to download the source from github and compile it. <a href=\"https://github.com/kristapsdz/acme-client-portable\">https://github.com/kristapsdz/acme-client-portable</a></li>\n<li>Cron can be used in place of periodic.conf to automate stuff</li>\n<li>Your nginx config will probably be at <code>/etc/nginx</code> instead of <code>/usr/local/etc/nginx</code>.</li>\n</ul>\n<h2>What If I Use Windows?</h2>\n<p>You're on your own there.</p>\n<h2>Problems and Stuff</h2>\n<p>If any of the steps I posted here don't work for you, let me know! Email me or tweet me or something. I'll make sure to update any errors.</p>\n<h2>References</h2>\n<p><a href=\"https://kristaps.bsd.lv/acme-client/\">https://kristaps.bsd.lv/acme-client/</a></p>\n<p><a href=\"https://www.freshports.org/security/acme-client\">https://www.freshports.org/security/acme-client</a></p>","frontmatter":{"title":"Using acme-client for LetsEncrypt on FreeBSD"}}},"pageContext":{"slug":"/2017-01-24-using-acme-client-with-free-bsd/"}}