{"data":{"markdownRemark":{"html":"<p>I recently became the proud owner of a hand me down <a href=\"http://support.hp.com/us-en/product/HP-LaserJet-1020-Printer-series/439423\">HP LaserJet 1020</a>. It's a fairly basic laser printer that prints in black and white, and only has a USB 2.0 interface. I was happy to take it, since I only really print text documents and I wouldn't have to spend a ridiculous amount of money on printer ink, but I wanted a printer that I could use from my laptop or my desktop. I also did not want to have to depend on my desktop or laptop to be on for the printer to receive print jobs. I had an unused Raspberry Pi 2 sitting around, so I thought that using the Raspberry Pi as a print server would do the trick.</p>\n<h3>Setting up the Pi</h3>\n<p>The first step to getting a networked printer was to install Linux on the Raspberry Pi. I chose to use the <a href=\"https://www.raspberrypi.org/downloads/raspbian/\">Raspian Jessie Lite</a> image. Since I'm not planning on running a display server on this Pi, I chose to dedicate the smallest split of RAM to video.</p>\n<p>Once the Pi was up and running I plugged in the printer to the Pi and installed CUPS.</p>\n<h3>Installing/Configuring CUPS</h3>\n<p>To install CUPS run</p>\n<pre><code class=\"language-sh\">sudo apt install cups\n</code></pre>\n<p>Once CUPS is installed, it's helpful to add your current user to the <code>lpadmin</code> user group so that you can do administrative actions within the CUPS web UI.</p>\n<p>To add your user to the <code>lpadmin</code> group run</p>\n<pre><code class=\"language-sh\"># Using the pi user as an example\nsudo usermod -a -G lpadmin pi\n</code></pre>\n<p>It is also helpful to edit the CUPS config file to have CUPS listen on a port so that you can access it's configuration UI from another computer.</p>\n<p>In <code>/etc/cups/cupsd.conf</code> find a line that looks like</p>\n<pre><code>Listen localhost:631\n</code></pre>\n<p>Comment that line out and add new line that says <code>Port 631</code>. The config file should like this at this point.</p>\n<pre><code># Listen localhost:631\nPort 631\n</code></pre>\n<p>Following that, add a line <code>Allow @local</code> to the <code>Location</code> blocks further down in the config file. It should look like</p>\n<pre><code>&#x3C; Location / >\n# Restrict access to the server...\nOrder allow,deny\n# Add this line here\nAllow @local\n&#x3C; /Location >\n\n&#x3C; Location /admin >\n# Restrict access to the admin pages...\nOrder allow,deny\n# Add this line here\nAllow @local\n&#x3C; /Location >\n\n&#x3C; Location /admin/conf >\nAuthType Default\nRequire user @SYSTEM\n\n# Restrict access to the configuration files...\nOrder allow,deny\n# Add this line here\nAllow @local\n&#x3C; /Location >\n</code></pre>\n<p><strong><em>DISCLAIMER:</em></strong> This means that any one on your LAN can view the CUPS web UI. They still need your system user password to do administrative tasks, but they can view some printer statuses.</p>\n<p>After this, restart CUPS using the command</p>\n<pre><code class=\"language-sh\">sudo systemctl restart cups\n</code></pre>\n<p>Now you can access the CUPS web UI by going to <code>http://&#x3C;your pi's ip address>:631</code>.</p>\n<p>Click the <code>Add Printer</code> button and login with your system username and password.</p>\n<p>Look for your printer in the Local Printers list. I checked the Share This Printer checkbox, but I'm not sure if that's necessary.</p>\n<p>On the next screen, see if the list of models has an entry for your printer model. If you don't see your model, check to see if your model is supported by <a href=\"http://foo2zjs.rkkda.com/\">foo2zjs</a>. My LaserJet 1020 did not have a driver in CUPS, so I downloaded the zipped archive for my printer from <code>foo2zjs</code>.</p>\n<h3>Drivers from foo2zjs</h3>\n<p>To build a driver from <code>foo2zjs</code></p>\n<pre><code class=\"language-sh\">tar xvf foo2zjs.tar.gz\ncd foo2zjs\nmake\nsudo make install\n</code></pre>\n<p>The <code>INSTALL</code> file will give you additional information about compiling and installing foo2zjs drivers.</p>\n<p>After this you should restart CUPS again.</p>\n<p>At this point you should be able to add your printer with the CUPS web UI using the <code>zoo2zjs</code> driver listed in the list of printer models in the Add Printer page.</p>\n<h3>Printing from other computers</h3>\n<p>I was able to connect with this printer over OSX and Linux using the <code>ipp://&#x3C;hostname>:631/printers/&#x3C;printer_name></code> address.</p>\n<p>So, if your Pi's IP address is <code>192.168.2.2</code> and the printer name you gave your printer is <code>cool_printer</code>, the address would be <code>ipp://192.168.2.2:631/printers/cool_printer</code>.</p>\n<p>For some reason I wasn't able to get this to work on Windows. I read a little that people have more luck sharing a printer using Samba, but I don't really use Windows enough to warrant the extra work.</p>","frontmatter":{"title":"How to make an old printer a networked printer"}}},"pageContext":{"slug":"/2016-10-08-make-an-old-printer-a-networked-printer/"}}