{"data":{"markdownRemark":{"html":"<p><a href=\"https://en.wikipedia.org/wiki/Internet_Relay_Chat\">IRC</a> is pretty cool, you can find chat rooms for almost any topic <a href=\"irc.rizon.net\">rizon</a> or ask questions and talk about technology and open source projects on <a href=\"irc.freenode.net\">freenode</a>. The <a href=\"http://cplug.org\">Cal Poly Linux User's Group</a> has a semi-active channel at #cplug on freenode where you can discuss Linux, open source, or anything about computers with local people.</p>\n<p>Weechat is an IRC client that runs in a terminal with a curses interface. There are other clients that are web based (<a href=\"http://kiwiiirc.com\">kiwiirc</a>) and graphical applications (<a href=\"https://hexchat.github.io\">hexchat</a>), but if you are looking to use a terminal-based client, I've found the Weechat is the most user-friendly from the start.</p>\n<h2>Installation</h2>\n<h3>OSX/MacOS</h3>\n<p>You'll need homebrew to easily install it.</p>\n<pre><code>   brew install weechat\n</code></pre>\n<h3>Linux</h3>\n<p>A fairly recent build of Weechat should be in your Linux distro's package repositories.</p>\n<h2>Configuration</h2>\n<p>Weechat does not need much configuration to get running, but at the least you will need to add the server you wish to connect to.</p>\n<p>In this example we'll add the rizon IRC server. In order to do this open weechat and type</p>\n<pre><code>/server add rizon irc.rizon.net 6667\n</code></pre>\n<p>if you'd like to connect with SSL do</p>\n<pre><code class=\"language-sh\"># NOTE: You may need to add an ssl certificate bundle in order for this to work\n/server add rizon irc.rizon.net 6697 -ssl\n</code></pre>\n<p>Next, you'll want to specify which nick (username) you want to use on this server. You can do this with the <strong>/set</strong> command. If you specify multiple nicks, the first one available will be used.</p>\n<pre><code>/set irc.server.rizon.nicks \"nick1, nick2, nick3\"\n</code></pre>\n<p>If you'd like to configure any other server properties, you can modify them with</p>\n<pre><code>/set irc.server.&#x3C;server name>.&#x3C;property> &#x3C;value>\n</code></pre>\n<p>You can now connect to the server using</p>\n<pre><code>/connect &#x3C;server name>\n</code></pre>\n<p>The next step is to join a channel.</p>\n<pre><code>/join #/g/sicp\n</code></pre>\n<p>You should now be in a channel, and should see a list of users currently in that channel in a list on the right side of the terminal. To join another channel, use that same command from above. When you are in multiple channels you can naviate between different channels you have joined by using the <strong>alt + left arrow/right arrow</strong> key combos. <strong>alt + [0-10]</strong> will take you to the first ten channels you've joined. You can also quickly move to channels that have had activity in them by using <strong>alt + a</strong>.</p>\n<p>For extra usability I recommend running</p>\n<pre><code>/mouse enable\n</code></pre>\n<p>which lets you use your mouse to scroll and interact with Weechat.</p>\n<h2>Persistence</h2>\n<p>If you would like to always be available in a channel in order to maintain a chat history or be available for mentions, consider running weechat in a screen or tmux session on a server.</p>\n<p>By doing this you can access your IRC client by ssh'ing into your server and attaching the screen or tmux session that Weechat is running on. Once you're done chatting, you can detach the session and go on your way without logging out of your channels.</p>","frontmatter":{"title":"Using Weechat for IRC"}}},"pageContext":{"slug":"/2016-08-14-basic-weechat-configuration-for-irc/"}}