{"data":{"markdownRemark":{"html":"<p>I wrote a post about <a href=\"https://devopps.me/blog/how-to/2016/10/23/dockerizing-pulldasher.html\">using Pulldasher with Docker</a> a few months ago to explain how to use Docker to run Pulldasher or debug Pulldasher anywhere. One of the shortcomings of that post was that it required keeping track of two independent containers in order to run Pulldasher locally. The end result was either needing an already configured MySQL database to connect to (not great when internet sucks) or always needing to be aware of whether or not a local MySQL container is up and what IP address it has (annoying to keep track of). This post explores using <code>docker-compose</code> to set up \"one-click\" Pulldasher installs. The main inspiration behind this new setup was to make it as seemless as possible to go from cloning the project to having a funcitonal instance.</p>\n<h2>Preparation</h2>\n<p>This section describes changes made to Pulldasher to make setup with <code>docker-compose</code> more user-friendly.</p>\n<p>When I was <a href=\"https://devopps.me/blog/how-to/docker/2017/02/03/using-docker-compose-with-multi-service-apps.html\">setting up CallPower</a> with <code>docker-compose</code>, I was really impressed by how easy it was to start and stop a full web application without having to manually create database tables, run migration scripts, etc. The current Pulldasher configuration routine requires manually creating a database, <code>source</code>-ing a <code>schema.sql</code> file to create the tables that the application is expecting, and then starting the node application. All of these steps have been manual, because Pulldasher was developed on EC2 instances, where the test database was always reachable and properly configured. Pulldasher has never really had a migration system, but this hasn't been a problem because the schema has been fairly static for the last two years.</p>\n<p>For a quick solution, I added a new script called <code>migrate.js</code> to the repo, which will run the <code>schema.sql</code> file on the database specified in <code>config.js</code>. I also modified the <code>schema.sql</code> file to not drop tables if they already exist and to not complain if the table already exists. My goal was that this script could be run everytime Pulldasher starts and if the database was not configured, it would be automatically. Otherwise, the script would have no effect on the database and Pulldasher would start as normal.</p>\n<pre><code class=\"language-js\">// migrate.js\nvar mysql = require('mysql'),\n    config = require('./config'),\n    fs = require('fs');\n\nvar db = mysql.createConnection({\n   host: config.mysql.host,\n   database: config.mysql.db,\n   user: config.mysql.user,\n   password: config.mysql.pass,\n   multipleStatements: true\n});\n\nconsole.log(\"Running this script will initalize your database for pulldasher.\");\nconsole.log(\"It will not drop any existing tables.\");\n\nfs.readFile('./schema.sql', function(err, data) {\n   if (err) {\n      throw err;\n   }\n\n   db.query(data.toString(), function(err, res, fields) {\n      // If the connection fails, return a failure code so that entrypoint.sh\n      // will retry this script.\n      if (err) {\n         console.log(err);\n         process.exit(1);\n      }\n\n      db.end(function(err) {\n         if (err) {\n            throw err;\n         }\n      });\n   });\n});\n</code></pre>\n<p>If the Pulldasher database schema becomes more dynamic it will probably be worth the effort to add in a migration system or switch to a more ORM-like MySQL node package, but for now this solution seems to do the job. Using a new shell script called <code>entrypoint.sh</code>, we can start Pulldasher by running <code>migrate.js</code> and <code>bin/pulldasher</code> sequentially.</p>\n<pre><code class=\"language-sh\">#!/bin/sh\n# Entrypoint for docker-compose service\n\n# Wait for the DB to start accepting connections.\nfor i in $(seq 5); do\n   echo \"Attempt $i\"\n   node migrate.js &#x26;&#x26; break || sleep 10\ndone\n\necho \"Setup done, starting pulldasher...\"\n\n# Start pulldasher\nnode bin/pulldasher\n</code></pre>\n<h2>The docker-compose configuration</h2>\n<p>Now that there's a way to automatically configure the database from the first time Pulldasher starts up, we can move on to actually specificying how we want the services/containers that make up Pulldasher to relate.</p>\n<h3>Web</h3>\n<p><code>web</code> is the container that will run the main node application. This container's image is built from the Dockerfile that the previous Pulldasher blog post explains, but the actual container will have a few modifications. This procedure is meant for development, so it's helpful to mount the current host directory to the working directory of the container. By doing this, we can modify the code locally and have the changes immediately reflected in the container. Without this, we would have to rebuild the image everytime we change some code, which would eat up a lot of time. The container's working directory is <code>/opt/pulldasher</code>, so we can specify a volume for the <code>web</code> container in <code>docker-compose.yml</code> that maps <code>.</code> to <code>/opt/pulldasher</code>. We also need to specify an image to create the container from. If there was a pulldasher image on a Docker registry, we could specify that name as an <code>image</code> field, but since we have the Dockerfile in the current directory we can specify a <code>build: .</code> field, which tells <code>docker-compose</code> to build a Docker image using a <code>Dockerfile</code> in the current directory. We also need to override the <code>ENTRYPOINT</code> specified in the Dockerfile. By default, a Pulldasher image will start by running <code>bin/pulldasher</code>, but in order to make sure MySQL is set up correctly, we want to run the new <code>entrypoint.sh</code>, which will run <code>migrate.js</code> and then run <code>bin/pulldasher</code>. Finally, publishing the container's port 8080 to the host's port 8080 will let use access the node application through <code>localhost:8080</code>.</p>\n<p>The <code>web</code> portion of the <code>docker-compose.yml</code> file should look like.</p>\n<pre><code>version: '2'\n\nservices:\n    web:\n        build: .\n        entrypoint: '/opt/pulldasher/entrypoint.sh'\n        ports:\n            - 8080:8080                # Map the container's port 8080 to the host's 8080\n                                                # NOTE: The host port will need to match\n                                                # the callback URL specified in the GitHub\n                                                # application setting.\n        volumes:\n            - .:/opt/pulldasher        # Mount the current directory to /opt/pulldasher\n</code></pre>\n<h3>DB</h3>\n<p><code>db</code> is the MySQL container that <code>web</code> will use to store data in. The configuation needs to specify the user, password, and database that Pulldasher is configured to connect to. It also needs to specify a persistent volume so that shutting down Pulldasher won't destroy the data stored in the <code>db</code> container. The <code>db</code> portion of the config file defines the necessary environment variables to start MySQL with, a <code>MariaDB</code> image to start the container from, a persistent volume named <code>db_data</code>, which is mounted to <code>/var/lib/mysql</code>.</p>\n<p>The complete <code>docker-compose.yml</code> should look like this.</p>\n<pre><code>version: '2'\n\nservices:\n   web:\n      build: .\n      entrypoint: '/opt/pulldasher/entrypoint.sh'\n      ports:\n         - 8080:8080                # Map the container's port 8080 to the host's 8080\n                                    # NOTE: The host port will need to match\n                                    # the callback URL specified in the GitHub\n                                    # application setting.\n      volumes:\n         - .:/opt/pulldasher        # Mount the current directory to /opt/pulldasher\n   db:\n      image: \"mariadb:latest\"\n      volumes:\n         - db_data:/var/lib/mysql   # Create a persistent volume so that we don't lose data between restarts\n      environment:\n         # Please use strong passwords if you are deploying pulldasher in a\n         # production environment.\n         MYSQL_ROOT_PASSWORD: pulldasher\n         MYSQL_DATABASE: pulldasher\n         MYSQL_USER: pulldasher\n         MYSQL_PASSWORD: pulldasher\nvolumes:\n   db_data:\n</code></pre>\n<h2>What Now?</h2>\n<p>Before running starting the containers, you should run <code>npm install</code> to make sure that all of the dependencies are downloaded and assets are built. Once that's done, you can run <code>docker-compose up</code> and you should have a local instance of Pulldasher up and running.</p>\n<h2>Weird Stuff</h2>\n<p>When writing <code>entrypoint.sh</code>, I noticed that <code>migrate.js</code> would fail to connect to MySQL, especially when the MySQL container was starting on a fresh volume with zero configuration. In order to get around this, I built in a retry loop in <code>entrypoint.sh</code> that tries to run <code>migrate.js</code> five times with 10 seconds of sleep in between each attempt before giving up. This seemed to be the accepted thing to do.</p>","frontmatter":{"title":"Dockerizing Pulldasher 2: Docker Compose"}}},"pageContext":{"slug":"/2017-02-13-dockerizing-pulldasher-2/"}}